patch/soapLog.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.mercurypay.com/"><SOAP-ENV:Body><ns1:InitializePayment><ns1:request><ns1:MerchantID>870380001</ns1:MerchantID><ns1:Password></ns1:Password><ns1:Invoice>1715</ns1:Invoice><ns1:TotalAmount>15</ns1:TotalAmount><ns1:TaxAmount>0</ns1:TaxAmount><ns1:AVSAddress>4</ns1:AVSAddress><ns1:AVSZip>30329</ns1:AVSZip><ns1:TranType>Sale</ns1:TranType><ns1:CardHolderName></ns1:CardHolderName><ns1:Frequency>OneTime</ns1:Frequency><ns1:Memo>hhkpos-3.7</ns1:Memo><ns1:ProcessCompleteUrl>http://localhost/hhk/house/CheckedIn.php</ns1:ProcessCompleteUrl><ns1:ReturnUrl>http://localhost/hhk/house/CheckedIn.php</ns1:ReturnUrl><ns1:DisplayStyle>Custom</ns1:DisplayStyle><ns1:LogoUrl>http://localhost/hhk/conf/hostpaylogo.jpg</ns1:LogoUrl><ns1:PageTitle>Hospitality HouseKeeper</ns1:PageTitle><ns1:DefaultSwipe>Swipe</ns1:DefaultSwipe><ns1:AVSFields>Both</ns1:AVSFields><ns1:PartialAuth>on</ns1:PartialAuth><ns1:OperatorID>test</ns1:OperatorID><ns1:CardEntryMethod>Both</ns1:CardEntryMethod><ns1:CVV>on</ns1:CVV></ns1:request></ns1:InitializePayment></SOAP-ENV:Body></SOAP-ENV:Envelope>
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><InitializePaymentResponse xmlns="http://www.mercurypay.com/"><InitializePaymentResult><ResponseCode>100</ResponseCode><PaymentID /><Message>MerchantID and/or Password not received. Note that field names are case sensitive.</Message></InitializePaymentResult></InitializePaymentResponse></soap:Body></soap:Envelope><?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.mercurypay.com/"><SOAP-ENV:Body><ns1:InitializePayment><ns1:request><ns1:MerchantID>870380001</ns1:MerchantID><ns1:Password></ns1:Password><ns1:Invoice>1716</ns1:Invoice><ns1:TotalAmount>15</ns1:TotalAmount><ns1:TaxAmount>0</ns1:TaxAmount><ns1:AVSAddress>4</ns1:AVSAddress><ns1:AVSZip>30329</ns1:AVSZip><ns1:TranType>Sale</ns1:TranType><ns1:CardHolderName></ns1:CardHolderName><ns1:Frequency>OneTime</ns1:Frequency><ns1:Memo>hhkpos-3.7</ns1:Memo><ns1:ProcessCompleteUrl>http://localhost/hhk/house/CheckedIn.php</ns1:ProcessCompleteUrl><ns1:ReturnUrl>http://localhost/hhk/house/CheckedIn.php</ns1:ReturnUrl><ns1:DisplayStyle>Custom</ns1:DisplayStyle><ns1:LogoUrl>http://localhost/hhk/conf/hostpaylogo.jpg</ns1:LogoUrl><ns1:PageTitle>Hospitality HouseKeeper</ns1:PageTitle><ns1:DefaultSwipe>Swipe</ns1:DefaultSwipe><ns1:AVSFields>Both</ns1:AVSFields><ns1:PartialAuth>on</ns1:PartialAuth><ns1:OperatorID>test</ns1:OperatorID><ns1:CardEntryMethod>Both</ns1:CardEntryMethod><ns1:CVV>on</ns1:CVV></ns1:request></ns1:InitializePayment></SOAP-ENV:Body></SOAP-ENV:Envelope>
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><InitializePaymentResponse xmlns="http://www.mercurypay.com/"><InitializePaymentResult><ResponseCode>100</ResponseCode><PaymentID /><Message>MerchantID and/or Password not received. Note that field names are case sensitive.</Message></InitializePaymentResult></InitializePaymentResponse></soap:Body></soap:Envelope>